{
  "main": {
    "name": "Amanda Steinhauer",
    "occupation": "Software Developer",
    "description": "Here will be your description. Use this to describe what you do or whatever you feel best describes yourself to a potential employer",
    "image": "profilepic.png",
    "bio": "Use this bio section as your way of describing yourself and saying what you do, what technologies you like to use or feel most comfortable with, describing your personality, or whatever else you feel like throwing in.",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "amanda.steinhauer@protonmail.com",
    "phone": "647-226-9255",
    "address": {
      "city": "Toronto",
      "province": "Ontario"
    },
    "website": "https://amandasteinhauer.github.io/personal-website/",
    "social": [

      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/amanda-s-9a9101157/",
        "className": "fa fa-linkedin"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here you can create a short write-up of your skills to show off to employers",
    "education": [
      {
        "school": "University of Toronto",
        "degree": "Bachelors of Applied Science in Computer Engineering",
        "graduated": "April 2021",
        "description": "Describe your experience at school, what you learned, what useful skills you have acquired etc."
      }
    ],
    "work": [
      {
        "company": "Wattpad",
        "title": "Associate Engineer",
        "years": "May 2019 - August 2020",
        "description": "",
        "points": [
          "Created ETL data pipelines that scheduled, extracted, processed, and exported relevant data using python, SQL, spark and AWS to form datasets that delivered insights into the works created by users",
          "Built website pages and components using ReactJS, redux and JavaScript to increase user satisfaction and facilitate data collection",
          "Developed similarity models using python with natural language processing techniques (doc2vec, tfidf, etc.) and built a web service and API for the model to be used",
          "Engineered a LSTM-CRF named entity recognition model to identify the characters in a text with 98% precision",
          "Developed a comment toxicity detection model with 65% accuracy to identify harmful comments on the platform to keep the community safe"
        ]
      },
      {
        "company": "Lawo",
        "title": "Student Developer",
        "years": "May 2018 - December 2018",
        "description": "",
        "points": [
            "Developed various web applications using C#, Go, JavaScript, HTML, and CSS",
            "Performed extensive testing on web applications to ensure functionality and performance requirements were met ",
            "Improved the performance of a custom JSON de-serializer by 120%"
        ]
      },
      {
        "company": "University of Toronto Engineering Outreach",
        "title": "Counselor",
        "years": "June 2017 - August 2017",
        "description": "",
        "points": [
            "Taught students to program games and web applications, such as a website hosting a custom snake game using JavaScript, HTML5 and CSS",
            "Assisted students with understanding C++ image detection and processing programs used in the robots for the camp",
            "Used version control software (SVN) and unit testing to ensure students always had a working copy of their programs"
        ]
      }
    ],
    "skills": [
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Illustrator",
        "level": "55%"
      },
      {
        "name": "ReactJs",
        "level": "50%"
      },
      {
        "name": "CSS",
        "level": "90%"
      },
      {
        "name": "HTML5",
        "level": "80%"
      },
      {
        "name": "VueJs",
        "level": "50%"
      },
      {
        "name": "MongoDB",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Canadian Wanderlust",
        "category": "My Travel Blog for my post-university travels",
        "image": "canadian-wanderlust.jpg",
        "url": "https://www.canadianwanderlust.com"
      },
      {
        "title": "Fury Fighting Gear",
        "category": "(offline now) A fighting gear company I started",
        "image": "fury-fighting-gear.jpg",
        "url": "http://www.timbakerdev.com"
      } 
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
